//#include <stdio.h>
//
//int main()
//{
//	/*
//	for (初始化表达式; 条件表达式; 更新表达式) {
//		// 循环体
//	}
//
//	for循环中的表达式时可以省略的
//	*/
//
//	////1.省略初始化语句
//	//int i = 1; // 提前初始化循环变量
//	//// 省略初始化部分，直接写 ;
//	//for (; i <= 5; i++) {
//	//	printf("i = %d\n", i);
//	//}
//	
//
//	//2.省略条件判断语句
//	//int i;
//	//// 条件部分省略，默认视为 true，循环会一直执行
//	//for (i = 1; ; i++) {
//	//	if (i > 3) {
//	//		break; // 手动终止循环
//	//	}
//	//	printf("i = %d\n", i);
//	//}
//
//
//	//3.省略更新表达式
//	//int i;
//	//for (i = 1; i <= 5; ) { // 省略更新部分
//	//	printf("i = %d\n", i);
//	//	i++; // 在循环体内更新变量
//	//}
//
//
//	//省略多个部分
//	//int i = 1;
//	//for (; i <= 5; ) {
//	//	printf("i = %d\n", i);
//	//	i++;
//	//}
//
//
//
//	//// 三个部分都省略，等价于 while(1)
//	//for (;;) {
//	//	printf("我会一直跑下去...\n");
//	//	//break; // 不加 break 就是死循环
//	//}
//
//		
//	/*
//	分号; 不能省：哪怕表达式为空，for(;;) 里的两个分号也必须保留。
//	省略条件表达式时：循环会一直执行，必须用 break 手动终止，否则就是死循环。
//	省略更新表达式时：一定要在循环体内更新循环变量，否则也会变成死循环。
//	这些写法在工程代码里用得不多，主要是为了理解 for 循环的底层逻辑。
//	*/
//	return 0;
//}