//#include <stdio.h>
//
//int main()
//{
//    /*
//		思路：原先的数字是123,反转后的数字是321
//		从右边开始,依次获取每一位数字,再次拼接起来
//    */
//    // 1.定义两个变量
//    int number = 123456;
//    int rev = 0;
//
//    // 2.从右边开始,依次获取number每一位数字,再次拼接到rev中
//    // 第一次获取: 123 % 10 = 3
//    // 0 * 10 + 3 = 3
//
//    // 第二次获取: 12 % 10 = 2
//    // 3 * 10 + 2 = 32
//
//    // 第三次获取: 1 % 10 = 1
//
//    // 循环的结束条件: number == 0
//    // 小括号当中书写的是: 什么情况下,循环要继续执行
//    while (number != 0)
//    {
//        // 获取number右边的第一位数字
//        int temp = number % 10;
//        // 去掉刚刚获取的数字
//        number = number / 10;
//        // 把刚刚获取的数字拼接到rev变量当中
//        rev = rev * 10 + temp;
//    }
//
//    // 输出结果
//    printf("反转后的数字为：%d\n", rev);
//
//    return 0;
//}